# internet=int(input("Введите сколько вы тратите на итернет"))
# eda=int(input("Введите сколько вы тратите на еду"))
# razvlechenia=int(input("Введите сколько вы тратите на развлечения"))
# transport=int(input("Введите сколько вы тратите на транспорт"))
# print("Вы тратите", internet+eda+razvlechenia+transport"))

#chek=int(input("Введите сумму счета-"))
#print("Чаевые",chek/100*15, ",общий счет", chek+chek/100*15)

# a=int(input("Введите любое двухзначное число-"))
# print("Последняя цифра этого числа", a%10)

# a=int(input("Введите любое трехзначное число-"))
# print("Последняя цифра этого числа", a%100%10)
