# print('''"Тут что-то не так, не будь я д'Артаньян"-подумал он"''')

# print("\"Тут что-то не так,\t не будь я д'Артаньян \"\n-подумал он\" ")

#s="Мама"
#print(max(s))
# s="мария"
# print(s[1:3])
# print(s[3])

# s="Программист"
# print(s[1:10:2])

#name=input("Введите свое имя-")
#ves=int(input("Введите свой вес-"))
#age=int(input("Введите свой возраст-"))
#print(name[0:2]*3+name,"\nвам", age*365*24*60*60, "секунд","\nваш вес на луне", ves//6, "кг")

s="Сидел барсук в своей норе и ел картошечку пюре"
print(len(s))
print(s+"!")
print("ре" in s)
print(s.count("ре"))
print(s[-2])
print(s[1: :2])
print(s.count(" ")+1)